In [2]:
import numpy as np
import pandas as pd

### Sorting and ranking

### Sorting

In [3]:
obj=pd.Series(range(3),index=['f','d','e'])

In [4]:
obj

f    0
d    1
e    2
dtype: int64

In [5]:
obj.sort_index()

d    1
e    2
f    0
dtype: int64

In [6]:
frame1=pd.DataFrame(np.arange(8).reshape((2,4)),index=['d','a'],columns=list('abcd'))

In [7]:
frame1

   a  b  c  d
d  0  1  2  3
a  4  5  6  7

In [8]:
frame1.sort_index()

   a  b  c  d
a  4  5  6  7
d  0  1  2  3

In [9]:
frame1.sort_index(axis=1)

   a  b  c  d
d  0  1  2  3
a  4  5  6  7

In [10]:
frame1.sort_index(axis=1,ascending=False)

   d  c  b  a
d  3  2  1  0
a  7  6  5  4

To sort a Series by its values, use its order method:

In [11]:
obj=pd.Series([2,3,4,-3,-2])

In [12]:
obj

0    2
1    3
2    4
3   -3
4   -2
dtype: int64

In [13]:
frame =pd. DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [16]:
frame.sort_index(by='b')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [17]:
frame.sort_index(by=['b','a'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [18]:
frame.sort_index(by=['a','b'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assign ranks from one through the number of valid data points in an array.
The rank method for series and dataframe are the place to look; by default rank breaks ties by assigning each 
group the mean rank

### Ranking

In [21]:
obj=pd.Series([4,5,6,8,3,2,2,9,1])
obj

0    4
1    5
2    6
3    8
4    3
5    2
6    2
7    9
8    1
dtype: int64

In [20]:
obj.rank()

0    5.0
1    6.0
2    7.0
3    8.0
4    4.0
5    2.5
6    2.5
7    9.0
8    1.0
dtype: float64

In [19]:
obj.rank(method='first')

0    5.0
1    6.0
2    7.0
3    8.0
4    4.0
5    2.0
6    3.0
7    9.0
8    1.0
dtype: float64

In [22]:
obj.rank(ascending=False,method='average')

0    5.0
1    4.0
2    3.0
3    2.0
4    6.0
5    7.5
6    7.5
7    1.0
8    9.0
dtype: float64

In [23]:
frame1

   a  b  c  d
d  0  1  2  3
a  4  5  6  7

In [24]:
frame1.rank(axis=1)

     a    b    c    d
d  1.0  2.0  3.0  4.0
a  1.0  2.0  3.0  4.0

### Axis indexes with duplicate values

In [25]:
obj=pd.Series(range(5),index=['a','a','b','c','c'])

In [26]:
obj

a    0
a    1
b    2
c    3
c    4
dtype: int64

The index is_unique property can tell you whether its label are unique or not

In [27]:
obj.index.is_unique

False

In [28]:
obj['c']

c    3
c    4
dtype: int64

In [29]:
obj['b']

2

In [30]:
df=pd.DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [31]:
df

          0         1         2
a  0.632335 -0.466124 -0.473077
a -0.537043  0.277048 -0.243733
b -0.092962 -0.913351  1.246560
b -0.389498 -0.959672  0.010581

In [32]:
df.loc['a']

          0         1         2
a  0.632335 -0.466124 -0.473077
a -0.537043  0.277048 -0.243733

### Summarizing and computing descriptive statistics

In [33]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
                index=['a','b','c','d'],columns=['one','two'])

In [34]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

calling dataframe's sum method returns a Series containing column sums

In [35]:
df.sum()

one    9.25
two   -5.80
dtype: float64

passing axis='columns',or axis=1 sums across the columns instead

In [36]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case)is NA
This can be disabled with skipna option

In [40]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [41]:
df.idxmax()

one    b
two    d
dtype: object

In [42]:
df.idxmin()

one    d
two    b
dtype: object

In [43]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [45]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [46]:
df.cumsum(axis=1)

    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [47]:
df.median()#Arithmetic mean 50% qunantile

one    1.4
two   -2.9
dtype: float64

In [48]:
df.mean()#mean of values

one    3.083333
two   -2.900000
dtype: float64

In [58]:
df.quantile()#compute sample qunatile range from 0 to 1

one    1.4
two   -2.9
Name: 0.5, dtype: float64

In [59]:
df.mad()#mean absolute deviation from from mean value

one    2.677778
two    1.600000
dtype: float64

In [60]:
df.prod()#product of values

one    7.455
two    5.850
dtype: float64

In [62]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

on non-numeric data, describe the produces alternative summary statistics:

In [52]:
obj=pd.Series(['a','a','b','c']*4)

In [54]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object